# **Que:1**

In [10]:
def calculate_area(length,width):
  if length == width:
    return "This is a Square!"
  else:
    area = length * width
    return area


def result():
  length, width = map(int,input('Enter the length and width : ').split())
  print(calculate_area(length, width))

result()

Enter the length and width : 5 5
This is a Square!

In [11]:
result()

Enter the length and width : 5 10
50

# **Que: 2**

In [71]:
def fibo(num):
   if num <= 1:
       return num
   else:
       return(fibo(num-1) + fibo(num-2))


print("Fibonacci sequence:")
n = int(input('Enter the terms: '))
for i in range(n):
    print(fibo(i))

Fibonacci sequence:
Enter the terms: 8
0
1
1
2
3
5
8
13

# **Que: 3**

**Install the mysql-connector library**

In [12]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.3.0-cp310-cp310-manylinux_2_17_x86_64.whl (21.5 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 21.5/21.5 MB 31.1 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.3.0

**Setup the connection with remote DB**

In [18]:
import mysql.connector

db = mysql.connector.connect(
  host="sql6.freesqldatabase.com",
  user="sql6680728",
  password="xVyyiVujG8",
  database="sql6680728"
)

print(db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x7f971abbc1c0>

**Create Table**

In [25]:
mycursor = db.cursor()
mycursor.execute("CREATE TABLE Students (student_id INT AUTO_INCREMENT PRIMARY KEY, first_name VARCHAR(20), last_name varchar(20), age int(3), grade float )")

**Insert Data**

In [64]:
def insert():
  fname,lname, age, grade = input("Enter the fname,lname, age, grade : ").split(',')
  sql = "INSERT INTO Students (first_name, last_name, age, grade) VALUES(%s, %s, %s, %s)"
  mycursor.execute(sql,(fname,lname,age,grade))
  db.commit()
  print(mycursor.rowcount, "was inserted.")

insert()

Enter the fname,lname, age, grade : Alice,Smith,18,95.5
1 was inserted.

**Selecting all the rows in the table**

In [65]:
def select():

  mycursor.execute("SELECT * FROM Students")
  myresult = mycursor.fetchall()
  for x in myresult:
    print(x)

select()

(2, 'Natalie', 'Parker', 18, 95.5)
(4, 'f', 'l', 56, 78.6)
(5, 'lucky', 'sharma', 78, 76.9)
(8, 'Ryan', 'Smith', 43, 87.0)
(9, 'Alice', 'Smith', 18, 95.5)

**updating the table where condition meet**

In [66]:
mycursor.execute("update Students set grade= 97.0 where first_name='Alice' ")
db.commit()

In [67]:
select()

(2, 'Natalie', 'Parker', 18, 95.5)
(4, 'f', 'l', 56, 78.6)
(5, 'lucky', 'sharma', 78, 76.9)
(8, 'Ryan', 'Smith', 43, 87.0)
(9, 'Alice', 'Smith', 18, 97.0)

**Deleting the row where condition meet**

In [68]:
mycursor.execute("delete FROM Students where last_name='Smith' ")
db.commit()

**Final Result**

In [69]:
select()

(2, 'Natalie', 'Parker', 18, 95.5)
(4, 'f', 'l', 56, 78.6)
(5, 'lucky', 'sharma', 78, 76.9)